Attached is a CSV file which has the following details about products from various ecommerce sites. <br>
● UUID (Primary Key) <br>
● Price (String) <br>
● Price_unfiltered (String)<br> 
● Product Type <br>
● Category <br>
● Level 1 -> This is just a classification of a product.

Task: Use the database to find the following results from this data. <br>
1. Products without prices <br>
2. Count of products without prices and with prices in each Product Type, Category, Level 1 <br>
3. Correct Product Prices in the correct format (eg: $56) wherever possible and separate them into currency and value columns.<br> 
4. List out the categories with average price of product. <br>
Brownie Points: Use graphs to depict this data. Use of Cloud Services

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./2022_02_08-02_30_31_AM.csv")
df.head()

,uuid,price_string,price_string_unf,product_type,level_1,category
0,638744a4-b0ae-4166-8cb6-5c063c862036,NaN,NaN,TGFwdG9wIENvdmVycy9CYWdz,TGFwdG9wIENhc2U,RWxlY3Ryb25pY3M
1,ab313969-02cc-48b2-9daf-0054efb70b92,NaN,NaN,QmFraW5nIEN1cHMgYW5kIE1hdHM,QmFraW5nIE1hdHMgLyBCYWtpbmcgZGlzaA,a2l0Y2hpbmcgYW5kIGRpbmluZw
2,acbd66ff-79f8-467a-91f9-108a45af5626,$19.95,NaN,R3VtbWllcyB2aXRhbWlucyBhbmQgbWluZXJhbHMgZm9yIG...,SW1tdW5pdHkgZ3VtbWllcw,SGVhbHRo
3,963915d6-b2e3-4098-b242-9410593cf205,$92.00,NaN,U2VydW1z,RmFjZSBTZXJ1bQ,YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
4,b5b68f3c-b1e0-40e5-8ee5-e2f7236c1daf,11.50,NaN,RWF0aW5nIFV0ZW5zaWxzL0N1dGxlcnk,Q2hvcHN0aWNrcw,a2l0Y2hpbmcgYW5kIGRpbmluZw

###### a quick EDA

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13730000 entries, 0 to 13729999
Data columns (total 6 columns):
 #   Column            Dtype
---  ------            -----
 0   uuid              object
 1   price_string      object
 2   price_string_unf  object
 3   product_type      object
 4   level_1           object
 5   category          object
dtypes: object(6)
memory usage: 628.5+ MB

In [4]:
df.isnull().sum()

uuid                       0
price_string         8220000
price_string_unf    13420000
product_type           10000
level_1                50000
category               10000
dtype: int64

In [5]:
df1 = df[["price_string","product_type"]] #this line will return a dataframe with columns price_string and product_type
df1.head()

  price_string                                       product_type
0          NaN                           TGFwdG9wIENvdmVycy9CYWdz
1          NaN                        QmFraW5nIEN1cHMgYW5kIE1hdHM
2       $19.95  R3VtbWllcyB2aXRhbWlucyBhbmQgbWluZXJhbHMgZm9yIG...
3       $92.00                                           U2VydW1z
4        11.50                    RWF0aW5nIFV0ZW5zaWxzL0N1dGxlcnk

In [6]:
df1.isnull().sum()

price_string    8220000
product_type      10000
dtype: int64

there may be chance of having a value in price_string column for a nan value in product_type column, so deleting all the rows having nan value in product_type column is better (to find out the accurate count of Products with prices in the future)

In [7]:
df1 = df1[df1['product_type'].notna()]

In [8]:
df1.isnull().sum()

price_string    8210000
product_type          0
dtype: int64

In [9]:
df1.price_string

0              NaN
1              NaN
2           $19.95
3           $92.00
4            11.50
             ...
13729995       NaN
13729996    $69.99
13729997       NaN
13729998       NaN
13729999    $55.00
Name: price_string, Length: 13720000, dtype: object

In [10]:
# products without price

In [11]:
df1[df1.price_string ==  "$0.00"]

         price_string                product_type
23              $0.00                QmVkc2hlZXRz
56              $0.00          Q2hlZWsgbWFrZSB1cA
250             $0.00                 TGlwIEJhbG0
267             $0.00              RXllIFNoYWRvdw
397             $0.00            RmFjZSBtYWtlIHVw
...               ...                         ...
13729016        $0.00            RHV2ZXQgY292ZXJz
13729128        $0.00                 TGlwIEJhbG0
13729425        $0.00  TGlwc3RpY2svIExpcCBjb2xvcg
13729603        $0.00            RmFjZSBtYWtlIHVw
13729729        $0.00          Q2hlZWsgbWFrZSB1cA

[240000 rows x 2 columns]

In [12]:
df_products_without_price = df1[df1.price_string ==  "$0.00"]
df_products_without_price.head(10)

    price_string        product_type
23         $0.00        QmVkc2hlZXRz
56         $0.00  Q2hlZWsgbWFrZSB1cA
250        $0.00         TGlwIEJhbG0
267        $0.00      RXllIFNoYWRvdw
397        $0.00    RmFjZSBtYWtlIHVw
409        $0.00     UGlsbG93Y2FzZXM
507        $0.00         TGlwIEJhbG0
528        $0.00    RmFjZSBtYWtlIHVw
547        $0.00    RHV2ZXQgY292ZXJz
587        $0.00    RmFjZSBtYWtlIHVw

#### TASK 1: Products without prices

In [13]:
df_products_without_price["product_type"]

23                        QmVkc2hlZXRz
56                  Q2hlZWsgbWFrZSB1cA
250                        TGlwIEJhbG0
267                     RXllIFNoYWRvdw
397                   RmFjZSBtYWtlIHVw
                       ...
13729016              RHV2ZXQgY292ZXJz
13729128                   TGlwIEJhbG0
13729425    TGlwc3RpY2svIExpcCBjb2xvcg
13729603              RmFjZSBtYWtlIHVw
13729729            Q2hlZWsgbWFrZSB1cA
Name: product_type, Length: 240000, dtype: object

#### 2. Count of products without prices and with prices in each Product Type, Category, Level 1

In [14]:
df_cleaned_price_string = df1[~df1['price_string'].isna()] #contains no nan values in price_string column)
df_cleaned_price_string.head(10)

   price_string                                       product_type
2        $19.95  R3VtbWllcyB2aXRhbWlucyBhbmQgbWluZXJhbHMgZm9yIG...
3        $92.00                                           U2VydW1z
4         11.50                    RWF0aW5nIFV0ZW5zaWxzL0N1dGxlcnk
6        $24.99                               TW9wcyBhbmQgYnJvb21z
7       $148.00                                   V29tZW5zIFBhbnRz
8           $89                                   V29tZW5zIFBhbnRz
9        $14.95                                    Um9sbGluZyBQaW4
10       $55.00                                     Q2FyZHN0b2Nrcw
11        32.99                                   Rm9vZCBTdG9yYWdl
12       $92.00                                           U2VydW1z

In [15]:
df_cleaned_price_string.shape

(5510000, 2)

In [16]:
df_products_with_price = df_cleaned_price_string[df_cleaned_price_string["price_string"] !=  "$0.00"] #selecting only the rows that don't have zero dollars

In [17]:
df_products_with_price.head(10)

   price_string                                       product_type
2        $19.95  R3VtbWllcyB2aXRhbWlucyBhbmQgbWluZXJhbHMgZm9yIG...
3        $92.00                                           U2VydW1z
4         11.50                    RWF0aW5nIFV0ZW5zaWxzL0N1dGxlcnk
6        $24.99                               TW9wcyBhbmQgYnJvb21z
7       $148.00                                   V29tZW5zIFBhbnRz
8           $89                                   V29tZW5zIFBhbnRz
9        $14.95                                    Um9sbGluZyBQaW4
10       $55.00                                     Q2FyZHN0b2Nrcw
11        32.99                                   Rm9vZCBTdG9yYWdl
12       $92.00                                           U2VydW1z

##### Count of products without prices in  Product Type

In [18]:
df_products_without_price.shape[0]

240000

##### Count of products with prices in  Product Type

In [19]:
df_products_with_price.shape[0]

5270000

#### Count of products with and without prices in categrory

In [20]:
df2 = df[["price_string","category"]]
df2.head()

  price_string                          category
0          NaN                   RWxlY3Ryb25pY3M
1          NaN        a2l0Y2hpbmcgYW5kIGRpbmluZw
2       $19.95                          SGVhbHRo
3       $92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
4        11.50        a2l0Y2hpbmcgYW5kIGRpbmluZw

In [21]:
df2.isnull().sum()

price_string    8220000
category          10000
dtype: int64

there may be chance of having a value in price_string column for a nan value in category column, so deleting all the rows having nan value in category column is better

In [22]:
df2 = df2[df2['category'].notna()]

In [23]:
df2.isnull().sum()

price_string    8210000
category              0
dtype: int64

In [24]:
df2[df2.price_string ==  "$0.00"] #products without prize

         price_string                          category
23              $0.00    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
56              $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
250             $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
267             $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
397             $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
...               ...                               ...
13729016        $0.00    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
13729128        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
13729425        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
13729603        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
13729729        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl

[240000 rows x 2 columns]

In [25]:
df2_products_without_price = df2[df2.price_string ==  "$0.00"]
df2_products_without_price.head(10)

    price_string                          category
23         $0.00    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
56         $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
250        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
267        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
397        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
409        $0.00    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
507        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
528        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
547        $0.00    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
587        $0.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl

In [26]:
df2_cleaned_price_string = df2[~df2['price_string'].isna()] #contains no nan values in price_string column)
df2_cleaned_price_string.head(10)

   price_string                          category
2        $19.95                          SGVhbHRo
3        $92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
4         11.50        a2l0Y2hpbmcgYW5kIGRpbmluZw
6        $24.99    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
7       $148.00  Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz
8           $89  Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz
9        $14.95               VG95cyBhbmQgR2FtZXM
10       $55.00                  QXJ0IHN1cHBsaWVz
11        32.99        a2l0Y2hpbmcgYW5kIGRpbmluZw
12       $92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl

In [27]:
df2_products_with_price = df2_cleaned_price_string[df2_cleaned_price_string["price_string"] !=  "$0.00"] #selecting only the rows that don't have zero dollars

In [28]:
df2_products_with_price.head(10)

   price_string                          category
2        $19.95                          SGVhbHRo
3        $92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
4         11.50        a2l0Y2hpbmcgYW5kIGRpbmluZw
6        $24.99    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
7       $148.00  Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz
8           $89  Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz
9        $14.95               VG95cyBhbmQgR2FtZXM
10       $55.00                  QXJ0IHN1cHBsaWVz
11        32.99        a2l0Y2hpbmcgYW5kIGRpbmluZw
12       $92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl

##### Count of products without prices in categrory

In [29]:
df2_products_without_price.shape[0]

240000

##### Count of products with prices in categrory

In [30]:
df2_products_with_price.shape[0]

5270000

#### Count of products with and without prices in level_1

In [31]:
df3 = df[["price_string","level_1"]]
df3.head()

  price_string                             level_1
0          NaN                     TGFwdG9wIENhc2U
1          NaN  QmFraW5nIE1hdHMgLyBCYWtpbmcgZGlzaA
2       $19.95              SW1tdW5pdHkgZ3VtbWllcw
3       $92.00                      RmFjZSBTZXJ1bQ
4        11.50                      Q2hvcHN0aWNrcw

In [32]:
df3.isnull().sum()

price_string    8220000
level_1           50000
dtype: int64

there may be chance of having a value in price_string column for a nan value in level_1 column, so deleting all the rows having nan value in level_1 column is better

In [33]:
df3 = df3[df3['level_1'].notna()]

In [34]:
df3.isnull().sum()

price_string    8180000
level_1               0
dtype: int64

In [35]:
df3[df3.price_string ==  "$0.00"] #products without prize

         price_string                     level_1
23              $0.00     UGVyY2FsZSBiZWRzaGVldHM
56              $0.00      RmFjZSBIaWdobGlnaHRlcg
250             $0.00                 TGlwIEJhbG0
267             $0.00              RXllIFNoYWRvdw
397             $0.00                Q29uY2VhbGVy
...               ...                         ...
13729016        $0.00  cGVyY2FsZSBkdXZldCBjb3Zlcg
13729128        $0.00                 TGlwIEJhbG0
13729425        $0.00    TGlwIENvbG9yL0xpcHN0aWNr
13729603        $0.00                Q29uY2VhbGVy
13729729        $0.00      RmFjZSBIaWdobGlnaHRlcg

[240000 rows x 2 columns]

In [36]:
df3_products_without_price = df3[df3.price_string ==  "$0.00"]
df3_products_without_price.head(10)

    price_string                   level_1
23         $0.00   UGVyY2FsZSBiZWRzaGVldHM
56         $0.00    RmFjZSBIaWdobGlnaHRlcg
250        $0.00               TGlwIEJhbG0
267        $0.00            RXllIFNoYWRvdw
397        $0.00              Q29uY2VhbGVy
409        $0.00    bGluZW4gcGlsbG93Y2FzZQ
507        $0.00               TGlwIEJhbG0
528        $0.00           RmFjZSBQcmltZXI
547        $0.00  c2F0ZWVuIGR1dmV0IGNvdmVy
587        $0.00              Q29uY2VhbGVy

In [37]:
df3_cleaned_price_string = df3[~df3['price_string'].isna()] #contains no nan values in price_string column)
df3_cleaned_price_string.head(10)

   price_string                               level_1
2        $19.95                SW1tdW5pdHkgZ3VtbWllcw
3        $92.00                        RmFjZSBTZXJ1bQ
4         11.50                        Q2hvcHN0aWNrcw
6        $24.99                                  TW9w
7       $148.00  V29tZW5zIFJlZ3VsYXIvQ2FzdWFsIFBhbnRz
8           $89                    V29tZW5zIFRpZ2h0cw
9        $14.95        UGxheSBEb3VnaCBSb2xsaW5nIFBpbg
10       $55.00                               Q2FyZHM
11        32.99                   Rm9vZCBDb250YWluZXI
12       $92.00                        RmFjZSBTZXJ1bQ

In [38]:
df3_products_with_price = df3_cleaned_price_string[df3_cleaned_price_string["price_string"] !=  "$0.00"] #selecting only the rows that don't have zero dollars
df3_products_with_price.head(10)

   price_string                               level_1
2        $19.95                SW1tdW5pdHkgZ3VtbWllcw
3        $92.00                        RmFjZSBTZXJ1bQ
4         11.50                        Q2hvcHN0aWNrcw
6        $24.99                                  TW9w
7       $148.00  V29tZW5zIFJlZ3VsYXIvQ2FzdWFsIFBhbnRz
8           $89                    V29tZW5zIFRpZ2h0cw
9        $14.95        UGxheSBEb3VnaCBSb2xsaW5nIFBpbg
10       $55.00                               Q2FyZHM
11        32.99                   Rm9vZCBDb250YWluZXI
12       $92.00                        RmFjZSBTZXJ1bQ

##### Count of products without prices in level_1

In [39]:
df3_products_without_price.shape[0]

240000

##### Count of products with prices in level_1

In [40]:
df3_products_with_price.shape[0]

5260000

## TASK 2: SUMMARY :-

Count of products without prices in  Product Type

In [41]:
df_products_without_price.shape[0]

240000

Count of products with prices in  Product Type

In [42]:
df_products_with_price.shape[0]

5270000

Count of products without prices in  category

In [43]:
df2_products_without_price.shape[0]

240000

Count of products with prices in  category

In [44]:
df2_products_with_price.shape[0]

5270000

Count of products without prices in  level_1

In [45]:
df3_products_without_price.shape[0]

240000

Count of products with prices in  level_1

In [46]:
df3_products_with_price.shape[0]

5260000

### 3. Correct Product Prices in the correct format (eg: $56) wherever possible and separate them into currency and value columns.

In [47]:
df.head()

,uuid,price_string,price_string_unf,product_type,level_1,category
0,638744a4-b0ae-4166-8cb6-5c063c862036,NaN,NaN,TGFwdG9wIENvdmVycy9CYWdz,TGFwdG9wIENhc2U,RWxlY3Ryb25pY3M
1,ab313969-02cc-48b2-9daf-0054efb70b92,NaN,NaN,QmFraW5nIEN1cHMgYW5kIE1hdHM,QmFraW5nIE1hdHMgLyBCYWtpbmcgZGlzaA,a2l0Y2hpbmcgYW5kIGRpbmluZw
2,acbd66ff-79f8-467a-91f9-108a45af5626,$19.95,NaN,R3VtbWllcyB2aXRhbWlucyBhbmQgbWluZXJhbHMgZm9yIG...,SW1tdW5pdHkgZ3VtbWllcw,SGVhbHRo
3,963915d6-b2e3-4098-b242-9410593cf205,$92.00,NaN,U2VydW1z,RmFjZSBTZXJ1bQ,YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
4,b5b68f3c-b1e0-40e5-8ee5-e2f7236c1daf,11.50,NaN,RWF0aW5nIFV0ZW5zaWxzL0N1dGxlcnk,Q2hvcHN0aWNrcw,a2l0Y2hpbmcgYW5kIGRpbmluZw

In [48]:
cdf = df[["price_string"]]
cdf.head()

  price_string
0          NaN
1          NaN
2       $19.95
3       $92.00
4        11.50

In [49]:
cdf = cdf.dropna()
cdf.head()

  price_string
2       $19.95
3       $92.00
4        11.50
6       $24.99
7      $148.00

In [50]:
cdf["currency"] = "Dollar"
cdf["value"] = cdf["price_string"].replace("[$,]", "", regex=True).astype(float)
cdf["cleaned_price_string"] = cdf['value'].apply( lambda x : '$' + str(x))
cdf.head(10)

   price_string currency   value cleaned_price_string
2        $19.95   Dollar   19.95               $19.95
3        $92.00   Dollar   92.00                $92.0
4         11.50   Dollar   11.50                $11.5
6        $24.99   Dollar   24.99               $24.99
7       $148.00   Dollar  148.00               $148.0
8           $89   Dollar   89.00                $89.0
9        $14.95   Dollar   14.95               $14.95
10       $55.00   Dollar   55.00                $55.0
11        32.99   Dollar   32.99               $32.99
12       $92.00   Dollar   92.00                $92.0

### 4. List out the categories with average price of product.

In [51]:
df.category.value_counts()

Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz       3910000
Z3JvY2VyaWVz                           1610000
SG91c2Vob2xkIGFuZCBDbGVhbmluZw         1570000
YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl       1470000
SGVhbHRo                                990000
VG95cyBhbmQgR2FtZXM                     790000
cGV0IHN1cHBsaWVz                        740000
QmFieWNhcmU                             660000
a2l0Y2hpbmcgYW5kIGRpbmluZw              590000
VG9vbHMgYW5kIGhvbWUgaW1wcm92ZW1lbnQ     520000
RWxlY3Ryb25pY3M                         320000
QXJ0IHN1cHBsaWVz                        320000
b2ZmaWNlIHByb2R1Y3Rz                    230000
Name: category, dtype: int64

In [52]:
nwdf = df[["price_string","category"]]
nwdf.head()

  price_string                          category
0          NaN                   RWxlY3Ryb25pY3M
1          NaN        a2l0Y2hpbmcgYW5kIGRpbmluZw
2       $19.95                          SGVhbHRo
3       $92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
4        11.50        a2l0Y2hpbmcgYW5kIGRpbmluZw

In [53]:
nwdf.isnull().sum()

price_string    8220000
category          10000
dtype: int64

In [54]:
nwdf = nwdf[nwdf['price_string'].notna()]
nwdf.isnull().sum()

price_string    0
category        0
dtype: int64

In [55]:
nwdf.price_string.dtype

dtype('O')

In [56]:
nwdf["price_string"] = nwdf["price_string"].replace("[$,]", "", regex=True).astype(float)

In [57]:
nwdf.head(10)

    price_string                          category
2          19.95                          SGVhbHRo
3          92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl
4          11.50        a2l0Y2hpbmcgYW5kIGRpbmluZw
6          24.99    SG91c2Vob2xkIGFuZCBDbGVhbmluZw
7         148.00  Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz
8          89.00  Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz
9          14.95               VG95cyBhbmQgR2FtZXM
10         55.00                  QXJ0IHN1cHBsaWVz
11         32.99        a2l0Y2hpbmcgYW5kIGRpbmluZw
12         92.00  YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl

In [58]:
nwdf.groupby(['category'])['price_string'].mean()

category
Q2xvdGhpbmcgYW5kIEFjY2Vzc29yaWVz       125.413871
QXJ0IHN1cHBsaWVz                        19.471053
QmFieWNhcmU                            163.688889
RWxlY3Ryb25pY3M                         60.258182
SG91c2Vob2xkIGFuZCBDbGVhbmluZw          76.199000
SGVhbHRo                                32.557586
VG95cyBhbmQgR2FtZXM                     32.448947
VG9vbHMgYW5kIGhvbWUgaW1wcm92ZW1lbnQ     82.223500
YmVhdXR5IGFuZCBwZXJzb25hbCBjYXJl        34.745067
Z3JvY2VyaWVz                            10.541667
a2l0Y2hpbmcgYW5kIGRpbmluZw              16.703235
b2ZmaWNlIHByb2R1Y3Rz                    20.480000
cGV0IHN1cHBsaWVz                        14.181875
Name: price_string, dtype: float64